Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/Microchip.PIC32CX-BZ3_DFP.pdsc
         <device Dname="WBZ350">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"/>
            <compile header="WBZ35/include/sam.h" define="__WBZ350__"/>
            <memory id="IROM1" start="0x0" size="0x10000"/>
            <memory id="IROM2" start="0x18000" size="0x00000800"/>
            <memory id="IROM3"
                    start="0x1000000"
                    size="0x80000"
                    default="1"
                    startup="1"/>
            <memory id="IROM4" start="0x800000" size="0x5000"/>
            <memory id="IROM5" start="0x806000" size="0x00001000"/>
            <memory id="IROM6" start="0x45000000" size="0x2000"/>
            <memory id="IRAM1" start="0x20000000" size="0x18000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="WBZ35/atdf/WBZ350.atdf"/>
                  <at:variant ordercode="WBZ350"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory name="ROM_SECURE_BOOT_ROM"
                             start="0x0"
                             size="0x10000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="ROM_SECURE_BOOT_PATCH"
                             start="0x18000"
                             size="0x00000800"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_PFM"
                             start="0x1000000"
                             size="0x80000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_BFM"
                             start="0x800000"
                             size="0x5000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_CFM"
                             start="0x805000"
                             size="0x00001000"
                             type="fuses"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_OTP_PAGE"
                             start="0x806000"
                             size="0x00001000"
                             type="flash"
                             pagesize="4096"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CMCC_TCM"
                             start="0x2000000"
                             size="0x1000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="RAM_SYSTEM_RAM"
                             start="0x20000000"
                             size="0x18000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="QSPI"
                             start="0x4000000"
                             size="0x1000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="PBA_BRIDGE"
                             start="0x40000000"
                             size="0x00004000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PBB_BRIDGE"
                             start="0x41000000"
                             size="0x00017000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PBC_BRIDGE"
                             start="0x42000000"
                             size="0x00012000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SILEX_SFR"
                             start="0x43000000"
                             size="0x20000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PBPIC_BRIDGE"
                             start="0x44000000"
                             size="0x00014000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="MCROM_ROM"
                             start="0x45000000"
                             size="0x2000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="SYSTEM_CM4F_SYSTEM_REGISTERS"
                             start="0xE0000000"
                             size="0x1fff4000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="WBZ35/edc/WBZ350.PIC"/>
                  <mchp:xc32 name="WBZ35/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="WBZ35/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="WBZ35/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="WBZ35/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="WBZ35/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=WBZ350"
                  title="Device page for WBZ350"/>
            <book name="https://www.microchip.com/wwwproducts/productds/WBZ350"
                  title="Datasheet"/>
         </device>
         <device Dname="WBZ351">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"/>
            <compile header="WBZ35/include/sam.h" define="__WBZ351__"/>
            <memory id="IROM1" start="0x0" size="0x10000"/>
            <memory id="IROM2" start="0x18000" size="0x00000800"/>
            <memory id="IROM3"
                    start="0x1000000"
                    size="0x80000"
                    default="1"
                    startup="1"/>
            <memory id="IROM4" start="0x800000" size="0x5000"/>
            <memory id="IROM5" start="0x806000" size="0x00001000"/>
            <memory id="IROM6" start="0x45000000" size="0x2000"/>
            <memory id="IRAM1" start="0x20000000" size="0x18000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="WBZ35/atdf/WBZ351.atdf"/>
                  <at:variant ordercode="WBZ351"
                              vccmin="1.90"
                              vccmax="3.60"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory name="ROM_SECURE_BOOT_ROM"
                             start="0x0"
                             size="0x10000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="ROM_SECURE_BOOT_PATCH"
                             start="0x18000"
                             size="0x00000800"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_PFM"
                             start="0x1000000"
                             size="0x80000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_BFM"
                             start="0x800000"
                             size="0x5000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_CFM"
                             start="0x805000"
                             size="0x00001000"
                             type="fuses"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_OTP_PAGE"
                             start="0x806000"
                             size="0x00001000"
                             type="flash"
                             pagesize="4096"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CMCC_TCM"
                             start="0x2000000"
                             size="0x1000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="RAM_SYSTEM_RAM"
                             start="0x20000000"
                             size="0x18000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="QSPI"
                             start="0x4000000"
                             size="0x1000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="PBA_BRIDGE"
                             start="0x40000000"
                             size="0x00004000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PBB_BRIDGE"
                             start="0x41000000"
                             size="0x00017000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PBC_BRIDGE"
                             start="0x42000000"
                             size="0x00012000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SILEX_SFR"
                             start="0x43000000"
                             size="0x20000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PBPIC_BRIDGE"
                             start="0x44000000"
                             size="0x00014000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="MCROM_ROM"
                             start="0x45000000"
                             size="0x2000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="SYSTEM_CM4F_SYSTEM_REGISTERS"
                             start="0xE0000000"
                             size="0x1fff4000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="WBZ35/edc/WBZ351.PIC"/>
                  <mchp:xc32 name="WBZ35/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="WBZ35/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="WBZ35/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="WBZ35/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="WBZ35/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="WBZ35/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=WBZ351"
                  title="Device page for WBZ351"/>
            <book name="https://www.microchip.com/wwwproducts/productds/WBZ351"
                  title="Datasheet"/>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="XC">
         <accept Tcompiler="XC"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="PIC32CX5109BZ31032">
         <require Dvendor="Microchip:3" Dname="PIC32CX5109BZ31032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CX5109BZ31048">
         <require Dvendor="Microchip:3" Dname="PIC32CX5109BZ31048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="WBZ350">
         <require Dvendor="Microchip:3" Dname="WBZ350"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="WBZ351">
         <require Dvendor="Microchip:3" Dname="WBZ351"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
