Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/Microchip.PIC32CX-BZ3_DFP.pdsc
   </conditions>
   <components>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CX5109BZ31032">
         <description>Headers and startup code for Microchip PIC32CX5109BZ31032</description>
         <files>
            <file condition="C" category="include" name="BZ3/include/"/>
            <file condition="C" category="header" name="BZ3/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="BZ3/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="BZ3/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="BZ3/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="BZ3/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="BZ3/gcc/gcc/startup_pic32cx5109bz31032.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="BZ3/gcc/system_pic32cx5109bz31032.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="BZ3/gcc/gcc/pic32cx5109bz31032_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="BZ3/gcc/gcc/pic32cx5109bz31032_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="BZ3/armcc/armcc/startup_pic32cx5109bz31032.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="BZ3/armcc/system_pic32cx5109bz31032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="BZ3/iar/iar/startup_pic32cx5109bz31032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="BZ3/iar/system_pic32cx5109bz31032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="BZ3/iar/config/linker/Microchip/pic32cx5109bz31032/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="BZ3/iar/config/linker/Microchip/pic32cx5109bz31032/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CX5109BZ31048">
         <description>Headers and startup code for Microchip PIC32CX5109BZ31048</description>
         <files>
            <file condition="C" category="include" name="BZ3/include/"/>
            <file condition="C" category="header" name="BZ3/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="BZ3/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="BZ3/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="BZ3/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="BZ3/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="BZ3/gcc/gcc/startup_pic32cx5109bz31048.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="BZ3/gcc/system_pic32cx5109bz31048.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="BZ3/gcc/gcc/pic32cx5109bz31048_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="BZ3/gcc/gcc/pic32cx5109bz31048_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="BZ3/armcc/armcc/startup_pic32cx5109bz31048.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="BZ3/armcc/system_pic32cx5109bz31048.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="BZ3/iar/iar/startup_pic32cx5109bz31048.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="BZ3/iar/system_pic32cx5109bz31048.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="BZ3/iar/config/linker/Microchip/pic32cx5109bz31048/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="BZ3/iar/config/linker/Microchip/pic32cx5109bz31048/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="WBZ350">
         <description>Headers and startup code for Microchip WBZ350</description>
         <files>
            <file condition="C" category="include" name="WBZ35/include/"/>
            <file condition="C" category="header" name="WBZ35/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="WBZ35/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="WBZ35/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="WBZ35/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="WBZ35/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="WBZ35/gcc/gcc/startup_wbz350.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="WBZ35/gcc/system_wbz350.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="WBZ35/gcc/gcc/wbz350_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="WBZ35/gcc/gcc/wbz350_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="WBZ35/armcc/armcc/startup_wbz350.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="WBZ35/armcc/system_wbz350.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="WBZ35/iar/iar/startup_wbz350.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="WBZ35/iar/system_wbz350.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="WBZ35/iar/config/linker/Microchip/wbz350/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="WBZ35/iar/config/linker/Microchip/wbz350/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="WBZ351">
         <description>Headers and startup code for Microchip WBZ351</description>
         <files>
            <file condition="C" category="include" name="WBZ35/include/"/>
            <file condition="C" category="header" name="WBZ35/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="WBZ35/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="WBZ35/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="WBZ35/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="WBZ35/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="WBZ35/gcc/gcc/startup_wbz351.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="WBZ35/gcc/system_wbz351.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="WBZ35/gcc/gcc/wbz351_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="WBZ35/gcc/gcc/wbz351_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="WBZ35/armcc/armcc/startup_wbz351.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="WBZ35/armcc/system_wbz351.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="WBZ35/iar/iar/startup_wbz351.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="WBZ35/iar/system_wbz351.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="WBZ35/iar/config/linker/Microchip/wbz351/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="WBZ35/iar/config/linker/Microchip/wbz351/flash.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
